{
  "semantics": [
    {
      "label": "Títol del joc",
      "description": "Aquest serà el títol del joc que esteu creant."
    },
    {
      "label": "Imatge de fons del tauler",
      "description": "Seleccioneu una imatge de fons per al tauler del vostre joc."
    },
    {
      "label": "Mida del tauler",
      "description": "Especifiqueu les dimensions del tauler de joc en píxels. La proporció entre amplada i alçada del tauler s'ha de correspondre amb la de la imatge de fons.",
      "fields": [
        {},
        {}
      ]
    },
    {
      "label": "Ombra",
      "description": "Dibuixa una ombra al voltant del tauler. Si activeu aquesta opció el tauler ocuparà una mica més d'espai que l'indicat a l'apartat de dimensions."
    },
    {
      "label": "Introducció al joc",
      "fields": [
        {
          "label": "Benvinguda i instruccions",
          "description": "Expliqueu de què va el joc i què ha de fer l'usuari."
        },
        {
          "label": "Text del botó d'inici",
          "description": "Text que es mostrarà al botó que l'usuari ha de pitjar per iniciar el joc."
        }
      ]
    },
    {
      "label": "Zones sensibles",
      "entity": "hotspot",
      "description": "El tauler de joc conté zones sensibles que es corresponen amb minijocs diferents. Per exemple: Preguntes, Penjat.",
      "field": {
        "label": "Zona sensible",
        "fields": [
          {
            "label": "Títol",
            "description": "Títol de la zona sensible."
          },
          {
            "label": "Imatge - Inicial",
            "description": "Imatge que identificarà aquesta zona sensible al tauler."
          },
          {
            "label": "Imatge - Passada",
            "description": "Imatge que representarà la zona sensible quan l'usuari hagi fet el minijoc i l'hagi completat correctament."
          },
          {
            "label": "Imatge - Fallada",
            "description": "Imatge que representarà la zona sensible quan l'usuari hagi fet el minijoc amb errors."
          },
          {
            "label": "Posició de la zona sensible",
            "description": "Posició de la cantonada superior esquerra de la zona sensible dins del tauler de joc, amb coordenades mesurades en píxels.",
            "default": {},
            "fields": [
              {},
              {}
            ]
          },
          {
            "label": "Acció",
            "description": "Escolliu el minijoc que s'iniciarà quan l'usuari faci clic en aquesta zona sensible."
          }
        ]
      }
    },
    {
      "label": "Indicador de progrés",
      "fields": [
        {
          "label": "Habilita l'indicador de progrés"
        },
        {
          "entity": "image",
          "description": "Seleccioneu les imatges a utilitzar per a l'indicador de progrés. Cal una imatge per a cada pas, més una altra per quan encara no hi hagi cap resultat.",
          "field": {
            "label": 0
          }
        },
        {
          "label": "Posició de l'indicador de progrés",
          "description": "Posició de l'indicador de progrés dins del tauler, amb coordenades mesurades en píxels.",
          "fields": [
            {},
            {}
          ]
        }
      ]
    },
    {
      "label": "Joc acabat",
      "fields": [
        {
          "label": "Vídeo d'acabament",
          "description": "Vídeo que es reproduïrà abans de mostrar els resultats."
        },
        {
          "label": "Permet a l'usuari saltar-se el vídeo d'acabament."
        },
        {
          "label": "Botó de saltar-se el vídeo",
          "description": "Text que es mostrarà al botó que permet saltar-se el vídeo d'acabament."
        }
      ]
    },
    {
      "label": "Resultats del joc",
      "fields": [
        {
          "label": "Resultat",
          "description": "Expliqueu la puntuació obtinguda en el joc. Podeu utilitzar les variables: @score (puntuació), @total i @percentage."
        },
        {
          "label": "Botó \"Reintenta\"",
          "description": "Text que es mostrarà al botó que permet tornar a començar de nou."
        },
        {
          "label": "Botó \"Mostra la solució\"",
          "description": "Text que es mostrarà als botons que l'usuari ha de prémer per veure les solucions."
        }
      ]
    },
    {
      "label": "Configuració dels botons \"Mostra la solució\" i \"Reintenta\".",
      "description": "Aquestes opcions permeten mostrar o amagar els botons encara que les opcions de l'activitat HP5 en la plataforma (Moodle, Wordpress, Drupal...) indiquin el contrari.",
      "fields": [
        {
          "label": "Força la visualització dels botons \"Mostra la solució\" i \"Reintenta\".",
          "description": "Quan aquesta opció estigui activada les opcions que es mostren a sota prevaldran sobre les fixades per a la plataforma."
        },
        {
          "label": "Habilita els botons \"Mostra la solució\".",
          "description": "Si activeu aquesta opció fareu que el botó \"Mostra la solució\" es mostri sempre."
        },
        {
          "label": "Habilita \"Reintenta\".",
          "description": "Si activeu aquesta opció fareu que el botó \"Reintenta\" es mostri sempre."
        }
      ]
    }
  ]
}